using System;
namespace Program
{
    class World
    {
        static void Main(string[] args)
        {
            int n = 0; //задана користувачем кількість строк 
            int m = 0; //задана користувачем кількість стовпців
            int range; //задане користувачем максимальне число у матриці
            int temp; //змінна для визначення кількості розрядів у чисел для вирівнення матриці
            int counter = 0; //лічильник для кількості розрядів максимального числа
            int counter2 = 0; //лічильник для кількості розрядів кожного нового числа в матриці
            int lower; //змінна, що буде набувати значення мінімального числа під час руху зліва направо
            string lowerword = ""; //змінна, що буде мати вигляд x[i][j], де х - мінімальне число під час руху зліва направо, i та j - індекси цього числа
            List<string> lowers = new(); //список для змінних lower
            int[,] matrix = new int[n, m];
            for (int i = 0; i < n; i++)
            {
                for (int j = 0; j < m; j++)
                {
                    Console.WriteLine(matrix[i, j]);
                }
            }
        }
    }
}